package leetcode

import (
	"fmt"
	"strings"
)

// @timeout: 5
func main(params map[string]interface{}) (interface{}, error) {
	printBinary(6)
	printBinary(int32(reverseBits(6)))
	return "Hello World!", nil
}

// 我的解法
func reverseBits1(num uint32) uint32 {
	high := 31
	low := 0
	for low < high {
		// 高位的二进制
		highBit := (1 << high) & num
		// 低位的二进制
		lowBit := (1 << low) & num
		if lowBit == 0 {
			num &= ^(1 << high)
		} else {
			num |= 1 << high
		}
		if highBit == 0 {
			num &= ^(1 << low)
		} else {
			num |= 1 << low
		}
		low++
		high--
	}
	return num
}

// 代码看着很魔幻吧？
// 给个例子，假设n二进制为：
// 1011 0111 0011 1001 0011 1111 0110 1010
// 解释一下，第一行，是把n左边16位，和n右边16位交换
// n = (n >>> 16) | (n << 16);
// 因为 n >>> 16 就是左边16位被移动到了右侧
// 同时 n << 16  就是右边16位被移动到了左侧
// 又 | 在了一起，所以，n变成了
// 0011 1111 0110 1010 1011 0111 0011 1001

// 第二行，
// n = ((n & 0xff00ff00) >>> 8) | ((n & 0x00ff00ff) << 8);
// (n & 0xff00ff00)
// 这一句意思是，左侧开始算0~7位，保留；8~15位，全变0；16~23位，保留；24~31位，全变0
// 0011 1111 0000 0000 1011 0111 0000 0000
// (n & 0xff00ff00) >>> 8 这句就是上面的值，统一向右移动8位，变成：
// 0000 0000 0011 1111 0000 0000 1011 0111
//
//
// (n & 0x00ff00ff)
// 这一句意思是，左侧开始算0~7位，全变0；8~15位，保留；16~23位，全变0；24~31位，保留
// 0000 0000 0110 1010 0000 0000 0011 1001
// (n & 0x00ff00ff) << 8 这句就是上面的值，统一向左移动8位，变成：
// 0110 1010 0000 0000 0011 1001 0000 0000
// 那么 ((n & 0xff00ff00) >>> 8) | ((n & 0x00ff00ff) << 8)
// 什么效果？就是n的0~7位和8~15位交换了，16~23位和24~31位交换了
// 0110 1010 0011 1111 0011 1001 1011 0111

// 也就是说，整个过程是n的左16位，和右16位交换
// n的左16位的内部，左8位和右8位交换；n的右16位的内部，左8位和右8位交换
// 接下来的一行，其实是，从左边开始算，0~7位内部，左4和右4交换；8~15位，左4和右4交换；...
// 接下来的一行，其实是，从左边开始算，0~3位内部，左2和右2交换；4~7位，左2和右2交换；...
// 最后的一行，其实是，从左边开始算，0~1位内部，左1和右1交换；2~3位，左1和右1交换；...
func reverseBits(num uint32) uint32 {
	// n的前16位和后16位交换顺序
	num = (num >> 16) | (num << 16)
	// 左组的前8位和右组的前8位交换顺序
	// 0xff00ff00 == 11111111 00000000 11111111 00000000
	// 0x00ff00ff == 00000000 11111111 00000000 11111111
	num = ((num & 0xff00ff00) >> 8) | ((num & 0x00ff00ff) << 8)
	// 左组的前4位和右组的前4位交换顺序
	num = ((num & 0xf0f0f0f0) >> 4) | ((num & 0x0f0f0f0f) << 4)
	// 左组的前2位和右组的前2位交换顺序
	num = ((num & 0xcccccccc) >> 2) | ((num & 0x33333333) << 2)
	// 左组的前1位和右组的前1位交换顺序
	num = ((num & 0xaaaaaaaa) >> 1) | ((num & 0x55555555) << 1)
	return num
}

func printBinary(num int32) {
	sb := strings.Builder{}
	for i := 31; i >= 0; i-- {
		if num&(1<<i) == 0 {
			sb.WriteString("0")
		} else {
			sb.WriteString("1")
		}
	}
	fmt.Println(sb.String())
}
